АлогистикТест2/src/Documents/алк_ЧисленныйСоставСмены/алк_ЧисленныйСоставСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ЧисленныйСоставСмены</name>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыУчастка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Персонал</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подрядчик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусСотрудника</name>
      <type>
        <types>CatalogRef.алк_СтатусыСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Транспорт</name>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Enums/алк_ВидЗначенияПоказателяОтчетов/алк_ВидЗначенияПоказателяОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидЗначенияПоказателяОтчетов</name>
  <enumValues>
    <name>Факт</name>
  </enumValues>
  <enumValues>
    <name>План</name>
  </enumValues>
  <enumValues>
    <name>Бюджет</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ЧисленныйСоставСмены/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;

	//Проверка уникальности документа
	ПараметрыЗаполнения = Документы.алк_ЧисленныйСоставСмены.ПолучитьСтруктуруЗаполнения_СоздатьДокумент();
	ПараметрыЗаполнения.Участок = Участок;
	ПараметрыЗаполнения.Направление = Направление;
	ПараметрыЗаполнения.ДатаСмены = ДатаСмены;
	ПараметрыЗаполнения.Смена = Смена;
	
	РезультатПроверкиУникальности = алк_ПроизводствоСервер.ПолучитьДокументЧисленныйСоставСмены(ПараметрыЗаполнения, Ложь, ЭтотОбъект.Ссылка);
	Если РезультатПроверкиУникальности <> Неопределено Тогда
		Сообщить("Ошибка уникальности. Документ с такими реквизитами смены уже был создан! Перепроверьте введенные данные или редактируйте уже созданный документ");
		Отказ = Истина;
	КонецЕсли;
	
	//удалим пустую строку персонал
	МассивПустыхСтрокПерсонала = Персонал.НайтиСтроки(Новый Структура("Должность, ФизическоеЛицо", Справочники.Должности.ПустаяСсылка(), Справочники.ФизическиеЛица.ПустаяСсылка()));
	
	Если МассивПустыхСтрокПерсонала <> 0 Тогда 
		Для Каждого эл ИЗ МассивПустыхСтрокПерсонала Цикл
			Персонал.Удалить(эл);
		КонецЦикла;
	КонецЕсли;
	//\\
	
	//удалим пустую строку транспорта
	МассивПустыхСтрокТранспорта = Транспорт.НайтиСтроки(Новый Структура("ТранспортноеСредство",Справочники.ТранспортныеСредства.ПустаяСсылка())); 
	
	Если МассивПустыхСтрокТранспорта.Количество() <> 0 Тогда 
		Для Каждого эл ИЗ МассивПустыхСтрокТранспорта Цикл
			Транспорт.Удалить(эл);
		КонецЦикла; 
	КонецЕсли;
	//\\ 
	
	//проверка, что заполнили фио сотрудников
	МассивПустыхФИО = Персонал.НайтиСтроки(Новый Структура("ФизическоеЛицо", Справочники.ФизическиеЛица.ПустаяСсылка())); 
	
	Если МассивПустыхФИО.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;  
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		Отказ = Истина; 
	КонецЕсли;   
	
	Сообщить("Ошибка!");
	
	Для Каждого эл ИЗ МассивПустыхФИО Цикл 
		Сообщить(СтрШаблон("Заполните ФИО сотрудника в строке %1!",эл.НомерСтроки));
	КонецЦикла;
	//\\
			
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения <> Неопределено Тогда 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);	
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Показатель = Справочники.алк_ОперацииПроизводства.ЧисленныйСоставСмены; //Численный состав смены (общая)
	
	Если Показатель <> Справочники.алк_ОперацииПроизводства.ПустаяСсылка() Тогда			
		РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.ДобавитьЗадание(
		ДатаСмены,
		Показатель,
		Перечисления.алк_ВидЗначенияПоказателяОтчетов.Факт);		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	//// регистр алк_ГрафикСмен
	//Движения.алк_ГрафикСмен.Записывать = Истина;
	//Движение = Движения.алк_ГрафикСмен.Добавить();
	//Движение.ДатаСмены = ДатаСмены;
	//Движение.Смена = Смена;
	//Движение.Участок = Участок;
	//Движение.Бригада = Бригада;
	
КонецПроцедуры
